/* this 사용 예시 */

function getEmptyRoomCount(hotel) {
    return hotel.방의개수 - hotel.예약자수;
}

let 호텔 = [{
    '이름' : '하나호텔',
    '위치' : '제주도 제주시 001',
    '가격' : {'A':50000, 'B':30000, 'C':15000},
    '방의개수' : 50,
    '예약자수' : 25,
    '남은방의개수' : function(){return this.방의개수 - this.예약자수}
  },{
    '이름' : '둘호텔',
    '위치' : '제주도 제주시 002',
    '가격' : {'A':100000, 'B':60000, 'C':30000},
    '방의개수' : 100,
    '예약자수' : 30,
    '남은방의개수' : function(){return this.방의개수 - this.예약자수}
  },{
    '이름' : '셋호텔',
    '위치' : '제주도 제주시 003',
    '가격' : {'A':80000, 'B':50000, 'C':30000},
    '방의개수' : 120,
    '예약자수' : 80,
    '남은방의개수' : function(){return this.방의개수 - this.예약자수}
  }];
  console.log(호텔[0]['남은방의개수']());      // 아래결과와 같습니다
  console.log(호텔[0].남은방의개수());         // 자료구조 파악이 용이
  console.log(getEmptyRoomCount(호텔[0]));  // 메모리 공간 효율적 사용
  console.log(호텔[1].남은방의개수());
  console.log(호텔[2].남은방의개수());